using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/// <summary>
/// Игорь Гусач
/// 
/// а) Дописать класс для работы с одномерным массивом. Реализовать конструктор, создающий
/// массив определенного размера и заполняющий массив числами от начального значения с
/// заданным шагом. Создать свойство Sum, которое возвращает сумму элементов массива, метод
/// Inverse, меняющий знаки у всех элементов массива, метод Multi, умножающий каждый элемент
/// массива на определённое число, свойство MaxCount, возвращающее количество максимальных
/// элементов. В Main продемонстрировать работу класса.
/// б)*Добавить конструктор и методы, которые загружают данные из файла и записывают данные в
/// файл.
/// </summary>
namespace Задача__2
{
    class TestArray
    {

    }
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
